## Skiprows method to skip unwanted rows form the csv file

In [19]:
import pandas as pd
df=pd.read_csv("stock_data.csv",skiprows=1)
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

## We also use header instead of skiprows to know the Header in csv

In [18]:
import pandas as pd
df=pd.read_csv("stock_data.csv",header=1)
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

## If we dont have header in our csv file then we can able to give name by using below method

In [23]:
df=pd.read_csv("stock_data.csv", header=None, names=["tickers","eps","revenue","price","people"])
df1=df.fillna("0")
df1

     tickers            eps  revenue  price         people
0  First Row              0        0      0              0
1    tickers            eps  revenue  price         people
2      GOOGL          27.82       87    845     larry page
3        WMT           4.61      484     65           n.a.
4       MSFT             -1       85     64     bill gates
5       RIL   not available       50   1023  mukesh ambani
6       TATA            5.6       -1   n.a.     ratan tata

## use nrows to read only n rows from the csv file

In [27]:
df2=pd.read_csv("stock_data.csv", nrows=3)
df2

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

## use na_values to make the values in df as NaN

In [30]:
df2=pd.read_csv("stock_data.csv", na_values=["not available","n.a."])
df2

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

## Filling NaN values to each and every column using dictionaries (Powerful Feature)

In [35]:
df2=pd.read_csv("stock_data.csv", na_values={
    'eps' : ["not available","n.a."],
    'revenue': ["not available","n.a.",-1],
    'price': ["not available","n.a."],
    'people': ["not available","n.a."]
    
    })
df2

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

## To Convert the data frame into csv file

In [36]:
df2.to_csv("Modified.csv")

## To delete or not convert the index as a column

In [38]:
df2.to_csv("2Modified.csv", index=False)

## Only we need to convert n columns into csv then use this method

In [40]:
df2.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [43]:
df2.to_csv("Only_Columns.csv",columns=['tickers','eps'],index=False)